<a href="https://colab.research.google.com/github/glorious44/mysql_assignment/blob/main/GEESQLASSINGMENT.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [49]:
import sqlite3
from datetime import date
#connect to (or create) the database file
conn=sqlite3.connect("edu_institute.db")
cursor=conn.cursor()

#create the students table
cursor.execute("""
CREATE TABLE IF NOT EXISTS students
(student_id INTEGER PRIMARY KEY,
 name TEXT,
 age INTEGER,
 gender TEXT,
 enrollment_date DATE,
 program TEXT
);
""")

conn.commit()
print ("Table created successfully")

Table created successfully

In [50]:
#insert students records
students_data= [
    (1, 'Glow',23,'F','2023-09-01','Data Science'),
    (2, 'Jim',27,'M','2022-08-01','Cyber Security'),
    (3, 'Jane',19, 'F','2024-01-15', 'Data Science'),
    (4, 'Davie',25,'M','2025-05-10','Project Manager'),
    (5,'Ann',18,'F','2025-07-18','Web Development'),
    (6,'Frank',21,'M','2024-08-10','Data Science'),

]

# Clear existing records to avoid IntegrityError on re-execution
cursor.execute("DELETE FROM students;")

cursor.executemany("""
INSERT INTO students(student_id,name,age,gender,enrollment_date,program)
VALUES(?,?,?,?,?,?)
""",students_data)
conn.commit()
print("Students records inserted successfully")

Students records inserted successfully

In [51]:
# 3.1 students in data science
print("3.1 Students in Data Science:")
cursor.execute("""
SELECT * FROM students
WHERE program='Data Science';
""")
print(cursor.fetchall())

3.1 Students in Data Science:
[(1, 'Glow', 23, 'F', '2023-09-01', 'Data Science'), (3, 'Jane', 19, 'F', '2024-01-15', 'Data Science'), (6, 'Frank', 21, 'M', '2024-08-10', 'Data Science')]

In [52]:
#total number of students
print("\n3.2 Total number of students:")
cursor.execute("""
SELECT COUNT(*) AS 'Total students' FROM students;
""")
print(cursor.fetchall())

3.2 Total number of students:
[(6,)]

In [53]:
# show current date
print("\n4.1 current date:")
cursor.execute("SELECT DATE('now') 'current date';")
print(cursor.fetchall())

4.1 current date:
[('2025-07-18',)]

In [54]:
#uppercasenames with enrolment date
print ("\n4.2 Names in uppercase with enrollment dates:")
cursor.execute("""
SELECT UPPER(name) AS 'Name',
enrollment_date FROM students;
""")
print(cursor.fetchall())

4.2 Names in uppercase with enrollment dates:
[('GLOW', '2023-09-01'), ('JIM', '2022-08-01'), ('JANE', '2024-01-15'), ('DAVIE', '2025-05-10'), ('ANN', '2025-07-18'), ('FRANK', '2024-08-10')]

In [55]:
#count number of students per program in desending order
print("\n5.1 student count per program:")
cursor.execute("""
SELECT program, COUNT(*) AS ' Number of Students'
FROM students
GROUP BY program
ORDER BY COUNT (*)DESC;
""")
print(cursor.fetchall())

5.1 student count per program:
[('Data Science', 3), ('Web Development', 1), ('Project Manager', 1), ('Cyber Security', 1)]

In [56]:
#youngest students name and age
print("\n5.2 Youngest student name and age:")
cursor.execute("""
SELECT name, MIN(age) AS 'Youngest Age'
FROM students;
""")
print(cursor.fetchall())

5.2 Youngest student name and age:
[('Ann', 18)]

In [30]:
conn.close()